Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: ཀླུའི་བདག་པོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ངེས་པར་སེམས་པའི་མཆོག་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པ་དང་། བྱམས་པ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་དང་། སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་དང་། དགའ་བ་ཆེན་པོས་འཁོར་བ་ན་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། བཏང་སྙོམས་ཆེན་པོས་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པ་དང་། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བས་རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པ་དང་། ཚུལ་ཁྲིམས་དང་། བསླབ་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་ཐམས་ཅད་ཡང་དག་པར་འཛིན་པས་བདག་ལ་མི་སྟོད་ཅིང་གཞན་ལ་མི་སྨོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཉེས་པར་བྱས་པ་བཟོད་པ་དང་། དེ་དག་དེ་ལྟར་རབ་ཏུ་ཐར་བར་བྱ་བའི་སེམས་ཀྱིས་བརྩོན་འགྲུས་བརྟན་པ་དང་། དགེ་བའི་རྩ་བ་སྒྲུབ་པའི་ཕྱིར་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་སྒྲུབ་པས་སེམས་ལ་བདག་དབང་བ་སྟེ། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་དབང་གིས་སྐྱེ་བ་མ་ཡིན་པ་དང་། ཤེས་རབ་དང་། མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་ལ་མཁས་པས་མངོན་པར་འདུ་མི་བྱེད་པ་ལས་མི་ཉམས་པ་དང་། ཐབས་ལ་མཁས་པས་སེམས་ཅན་ཐམས་ཅད་དང་འཐུན་པར་འཇུག་པ་དང་། ཡེ་ཤེས་དང་།
en: “Lord of nāgas, the supreme ascertainment for a bodhisattva consists in understanding the sameness of the entire realm of phenomena.

source: རྣམ་པར་གྲོལ་བ་ཀུན་དུ་སྲུང་བས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་། ཐེག་པ་ཆེན་པོ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འགྲོ་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་སྡུག་བསྔལ་ལ་མི་མཇེད་པ་དང་། ཆོས་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་འཐོབ་པ་དང་བཀུར་སྟི་ཐམས་ཅད་ལ་མི་ཆགས་པ་དང་། མཚན་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་བསོད་ནམས་ཀྱིས་མི་ངོམས་པ་དང་། ཤེས་རབ་ཡོངས་སུ་སྐྱོང་བས་ཐོས་པས་མི་ངོམས་པ་དང་། ཐོས་པ་ཡོངས་སུ་སྐྱོང་བས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པ་དང་། དགེ་བའི་ཆོས་ཡོངས་སུ་སྐྱོང་བས་གུས་པ་དང་བཅས་པ་དང་། བླ་མ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ང་རྒྱལ་བཅོམ་པ་དང་། ང་རྒྱལ་ཚར་གཅད་པའི་ཕྱིར་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་དང་།
en: It consists in, with great love, being impartial toward all beings; with great compassion, not overlooking anyone; with great joy, not being disheartened in saṃsāra; with great equanimity, being free of attachment and hostility; by abandoning all possessions, having no expectation of reward; by maintaining all the good qualities of discipline, training, and purity, neither praising oneself nor criticizing others; having patience for the wrongs committed by all beings; having stable perseverance; being committed to liberating beings; having no concern for life or limb in the pursuit of roots of virtue; having mastery over one’s mind through accomplishing the wisdom, absorptions, and attainments of the buddhas through which one is not reborn; not straying from the absence of fabrication through having mastered insight, the higher perceptions, and wisdom; engaging appropriately with all beings through skillful means; and guarding wisdom and liberation of all kinds—the wisdom of hearers and solitary buddhas as well as the wisdom of the buddhas that comes from immersion in the Great Vehicle; enduring suffering for the sake of maintaining the sacred Dharma; not being attached to any accomplishment or veneration gained from properly teaching the Dharma; not tiring of accumulating merit so as to perfect the marks; guarding insight by not tiring of learning; guarding learning by relying on virtuous spiritual friends; guarding virtuous qualities by behaving respectfully; overcoming pride so as to truly attain the status of a master; having excellent intention so as to eliminate pride; being without guile due to guarding one’s noble intention; acting in accordance with one’s words due to being without guile; not being deceitful so as to act in that way; abiding in truthfulness by abandoning all faults of speech and never lying; being authentic and being born out of authenticity; and being truthful and being born out of truth.

source: ལྷག་པའི་བསམ་པ་ཡོངས་སུ་སྐྱོང་བས་གཡོ་མེད་པ་དང་། གཡོ་དང་བྲལ་བས་ཇི་སྐད་སྨྲས་པ་བཞིན་བྱེད་པ་དང་། དེ་བྱེད་པའི་ཕྱིར་མི་སླུ་བ་དང་། བདེན་པའི་ཚིག་ལ་རབ་ཏུ་གནས་པས་ངག་གི་སྐྱོན་ཐམས་ཅད་རྣམ་པར་སྤངས་པ་སྟེ་བརྫུན་གྱི་ཚིག་དང་བྲལ་བ་དང་།
en: Those are certainties of mind.

source: ཡང་དག་པ་དང་ཡང་དག་པ་ལས་སྐྱེས་པ་དང་། བདེན་པ་དང་བདེན་པ་ལས་སྐྱེས་པ་ནི་སེམས་ངེས་པར་སེམས་པའོ། །ཀླུའི་བདག་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ངེས་པར་སེམས་པ་དེ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བག་ཡོད་པ་ཞེས་བྱའོ། །
en: Lord of nāgas, bodhisattvas with certainties of mind like these are known as the heedful.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་བག་ཡོད་པ་ལ་ནི་བདུད་ཀྱིས་ཚད་མི་རྙེད་དོ། །
en: “Lord of nāgas, heedful bodhisattvas are beyond the reach of Māra.

source: ཀླུའི་བདག་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚད་དུ་བྱ་བ་མ་ཡིན་པའི་ཆོས་ལ་སྤྱོད་དོ། །
en: Because, lord of nāgas, bodhisattvas conduct themselves with qualities that are unlimited.

source: དེ་ལ་ཚད་དུ་བྱ་བའི་ཆོས་རྣམས་གང་ཞེ་ན།
en: What are limited qualities?

source: འདོད་ཆགས་ནི་ཚད་དུ་བྱ་བའོ། །ཞེ་སྡང་དང་། གཏི་མུག་ནི་ཚད་དུ་བྱ་བའོ། །
en: Desire, aversion, and delusion are limited.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་ལས་འདས་པས་དེའི་ཕྱིར་ཚད་མེད་པ་ཞེས་བྱའོ། །
en: Since bodhisattvas have passed beyond them, they are said to be unlimited.

source: དམིགས་པར་ལྟ་བ་ནི་ཚད་དུ་བྱ་བའོ། །
en: Views that take an object are limited.

source: སྟོང་པ་ཉིད་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་བདུད་ཀྱིས་ཚད་མི་རྙེད་དོ། །
en: Bodhisattvas who abide in emptiness are beyond the reach of Māra.

source: རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པའི་མཚན་མ་ཐམས་ཅད་ནི་ཚད་དུ་བྱ་བའོ། །
en: All the signifiers of thought, conceptualization, and imputation are limited.

source: མཚན་མ་མེད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་བདུད་ཀྱིས་ཚད་མི་རྙེད་དོ། །
en: Bodhisattvas who abide in signlessness are beyond the reach of Māra.

source: ཁམས་གསུམ་པ་ནི་ཚད་དུ་བྱ་བའོ། །
en: The three realms are limited.

source: སྨོན་པ་མེད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་བདུད་ཀྱིས་ཚད་མི་རྙེད་དོ། །
en: Bodhisattvas who abide in wishlessness are beyond the reach of Māra.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ནི་ཚད་དུ་བྱ་བའོ། །
en: The vehicles of the hearers and solitary buddhas are limited.

source: ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་བདུད་ཀྱིས་ཚད་མི་རྙེད་དོ། །
en: Bodhisattvas who abide in the Great Vehicle are beyond the reach of Māra.

source: ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་བདུད་ཀྱི་ལས་ནི་གཉིས་པོ་འདི་དག་སྟེ།
en: “Lord of nāgas, for bodhisattvas there are two deeds of Māra.

source: བླ་མ་རྣམས་ལ་མི་གུས་པ་དང་། བདག་བརྗོད་པས་མངོན་པའི་ང་རྒྱལ་བྱེད་པའོ། །
en: They are lacking respect for masters and having the pride of conceit that asserts a self.

source: གཉིས་པོ་དེ་དག་ནི་བདུད་ཀྱི་ལས་ཏེ། དེ་དག་བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་སྤང་བར་བྱའོ། །
en: Those two are deeds of Māra that bodhisattvas must reject.

source: གཞན་ཡང་བདུད་ཀྱི་ལས་གཉིས་ཏེ།
en: “There are two further deeds of Māra.

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་འདོར་བ་དང་། འཇིག་རྟེན་རྒྱང་འཕེན་པའི་གསང་ཚིག་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་རབ་ཏུ་ལྡན་པའི་མདོ་སྡེ་ཀུན་འཛིན་པའོ། །
en: They are rejecting the bodhisattva collection—the path of the perfections—and instead adhering to the secret words of the Lokāyatas and all the scriptures of the vehicles of the hearers and solitary buddhas.

source: གཞན་ཡང་གཉིས་ཏེ།
en: “There are two further.

source: ཐབས་དང་བྲལ་བའི་ཤེས་རབ་དང་། ཤེས་རབ་དང་བྲལ་བའི་ཐབས་ཏེ་གཉིས་པོ་དེ་དག་གོ། །
en: They are insight devoid of skillful means and skillful means devoid of insight.

source: དེ་ལ་ཐབས་དང་བྲལ་བའི་ཤེས་རབ་ནི་འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་མི་ལྟ་ཞིང་འདུས་མ་བྱས་པའི་ཆོས་ལ་རྟོག་པའོ། །
en: Insight devoid of skillful means means realizing that phenomena are uncompounded but having no concern for beings.

source: ཤེས་རབ་དང་བྲལ་བའི་ཐབས་ནི་འདི་ལྟ་སྟེ། དམིགས་པར་ལྟ་བར་ལྷུང་བའི་བསྡུ་བའི་དངོས་པོ་བཞིའོ། །
en: Skillful means devoid of insight means possessing the four means of attraction but falling into views that fixate on reference points.

source: ཐོས་པ་ཉུང་ངུས་བསམ་གཏན་རྙེད་པ་དང་། མང་དུ་ཐོས་ཀྱང་བདག་སྟོད་པའོ། །
en: They are seeking concentration without much learning and praising oneself for being learned.

source: དགེ་བའི་རྩ་བ་དང་བྲལ་བས་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པ་དང་། དགེ་བའི་རྩ་བ་བསགས་ཀྱང་ཐེག་པ་ཆུང་ངུ་འདོད་པའོ། །
en: They are taking rebirth while being devoid of roots of virtue and having accumulated roots of virtue but being attracted to the lower vehicles.

source: དམ་པའི་ཆོས་མི་སྲུང་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མི་བྱེད་པའོ། །
en: They are not guarding the sacred Dharma and not bringing beings to maturity.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་ཞེ་ས་སྤངས་པ་དང་། ཆོས་སྨྲ་བའི་བསྔགས་པ་མི་བརྗོད་པ་དང་གཉིས་པོ་དེ་དག་སྟེ།
en: They are not using respectful language toward bodhisattvas and not praising Dharma teachers.

source: དེ་དག་བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་སྤང་བར་བྱའོ། །
en: Bodhisattvas must reject those two.

source: དགེ་བའི་རྩ་བ་ཡང་དག་པར་བླངས་པ་འདོར་བ་དང་། མི་དགེ་བའི་སེམས་དང་དུ་ལེན་པ་དང་གཉིས་པོ་དེ་དག་སྟེ།
en: They are rejecting opportunities to acquire roots of virtue and readily adopting nonvirtuous attitudes.

source: དགོན་པ་ལ་གནས་ཀྱང་འདོད་པ་དང་། གནོད་སེམས་དང་། འཚེ་བའི་རྣམ་པར་རྟོག་པ་དང་། འཁོར་གྱི་ཚོགས་ཀྱི་ནང་དུ་ཞུགས་ཀྱང་འཐོབ་པ་དང་། བཀུར་སྟིས་བསྐོར་བ་དང་གཉིས་པོ་དེ་དག་སྟེ།
en: They are entertaining lustful, malicious, and harmful thoughts when living in seclusion and being concerned with accomplishment and veneration when living within a congregation of monks.

source: སྣོད་མ་ཡིན་པ་ལ་སྟོན་པ་དང་།
en: They are teaching unworthy students and ignoring worthy students.

source: སྣོད་དུ་གྱུར་པ་ཁྱད་དུ་གསོད་པ་དང་གཉིས་པོ་དེ་དག་སྟེ། དེ་དག་བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་སྤང་བར་བྱའོ། །
en: Bodhisattvas must reject those two.

source: བདུད་ཀྱི་ལས་འདི་ལྟ་བུ་འདི་དག་ཁོང་དུ་མི་ཆུད་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་སེམས་ལ་གཡེང་བའོ། །
en: They are not comprehending these deeds of Māra and being distracted from the mind of omniscience.

source: གཉིས་པོ་དེ་དག་ནི་བདུད་ཀྱི་ལས་ཏེ། བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་སྤང་བར་བྱའོ། །
en: Those two are deeds of Māra that bodhisattvas must reject.

source: ཀླུའི་བདག་པོ་འདི་ལྟར་བག་ཡོད་པ་འདི་ལྟ་བུ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་ལས་དེ་ལྟ་བུ་དེ་དག་མི་འབྱུང་ངོ་། །
en: “Lord of nāgas, for a bodhisattva who lives as a heedful one, deeds of Māra such as these will not arise.

source: ཀླུའི་བདག་པོ་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྟོབས་བསྐྱེད་པ་བཅུ་དྲུག་རབ་ཏུ་འཐོབ་བོ། །
en: “Lord of nāgas, heedful bodhisattvas develop sixteen powers.

source: བཅུ་དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པའི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། བློ་གྲོས་ཀྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། རྟོགས་པའི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། ངོ་ཚ་ཤེས་པའི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། མོས་པའི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། བསོད་ནམས་ཀྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། གཟུངས་ཀྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། སྤོབས་པའི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་།
en: What are the sixteen?

source: གཟུགས་ཀྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། ལོངས་སྤྱོད་ཀྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། ལུས་ཀྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། སེམས་ཀྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། ཆོས་སྟོན་པའི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། བདུད་ཚར་གཅོད་པའི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་།
en: They are as follows: They develop the power of memory; they develop the power of intelligence; they develop the power of realization; they develop the power of modesty; they develop the power of conviction; they develop the power of merit; they develop the power of retention; they develop the power of eloquence; they develop the power of form; they develop the power of wealth; they develop the power of the body; they develop the power of the mind; they develop the power of magical transformation; they develop the power of teaching the Dharma; they develop the power of subjugating Māra; and they develop the power of perseverance.

source: ནན་ཏན་གྱི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་དང་། དེ་ལ་དྲན་པའི་སྟོབས་བསྐྱེད་པ་གང་ཞེ་ན།
en: “What is the developed power of memory?

source: དྲན་པ་གང་གིས་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ། ཀུན་ཏུ་འཛིན་པ་དང་། རབ་ཏུ་འཛིན་པའོ། །
en: It is the memory that can recall and retain the words of any buddha.

source: བློ་གྲོས་ཀྱི་སྟོབས་བསྐྱེད་པ་ནི། གང་བྱང་ཆུབ་སེམས་དཔའ་དེའི་བློ་གྲོས་དེ་སངས་རྒྱས་ཀྱིས་གནང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མི་ཕྱེད་པ་ཡིན་ནོ། །
en: The developed power of intelligence is the intelligence of a bodhisattva that has been bestowed by a buddha and that cannot be shaken by any being.

source: རྟོགས་པའི་སྟོབས་བསྐྱེད་པ་ནི་གང་སྒྲས་བསྟན་པའི་དོན་ཐམས་ཅད་རྟོགས་པར་འགྱུར་རོ། །
en: The developed power of realization means understanding all the meanings of an oral teaching.

source: ངོ་ཚ་ཤེས་པའི་སྟོབས་བསྐྱེད་པ་ནི་གང་མི་དགེ་བའི་ཆོས་རྣམ་པར་སྤངས་ནས་དགེ་བའི་ཆོས་ཐམས་ཅད་དང་ལྡན་པའོ། །
en: The developed power of modesty means being endowed with all virtuous qualities, having rejected all nonvirtuous qualities.

source: མོས་པའི་སྟོབས་བསྐྱེད་པ་ནི་གང་སྡུག་བསྔལ་རྙེད་ཀྱང་བླའི་བྱ་བ་མ་ཡིན་པ་མི་བྱེད་པའོ། །
en: The developed power of conviction means maintaining exalted behavior even in the face of hardship.

source: བསོད་ནམས་ཀྱི་སྟོབས་བསྐྱེད་པ་ནི་གང་བདུད་ཀྱི་སྡེ་བྱེ་བ་བརྒྱས་ཀྱང་ཟིལ་གྱིས་གནོན་མི་ནུས་པའོ། །
en: The developed power of merit means being unassailable by the billionfold hordes of Māra.

source: གཟུངས་ཀྱི་སྟོབས་བསྐྱེད་པ་ནི་གང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཐོས་ཤིང་དེ་ཐམས་ཅད་ཀུན་ཏུ་འཛིན་པ་དང་། མི་བརྗེད་པ་དང་། དེ་གཞན་དག་ལ་ཡང་སྟོན་པའོ། །
en: The developed power of retention means the ability to remember all the words of the Buddha upon hearing them, to not forget them, and to teach them to others.

source: སྤོབས་པའི་སྟོབས་བསྐྱེད་པ་ནི་གང་ངེས་པའི་ཚིག་གཞན་དང་གཞན་གྱིས་ཐོགས་པ་མེད་ཅིང་རྒྱུན་ཆད་པ་མེད་ལ་ཆགས་པ་མེད་པར་བསྐལ་པ་བརྒྱ་སྟོང་དུ་འཆད་པའོ། །
en: The developed power of eloquence is the ability to explain the teachings of definitive meaning for a hundred thousand eons without any obstacles, interruptions, or impediments.

source: གཟུགས་ཀྱི་སྟོབས་བསྐྱེད་པ་ནི་གང་བྱང་ཆུབ་སེམས་དཔའ་དེའི་གན་དུ་བརྒྱ་བྱིན་དང་། ཚངས་པ་ལ་སོགས་པ་ཉེ་བར་འོངས་ན་མོག་མོག་པོར་འགྱུར་བའོ། །
en: The developed power of form eclipses beings like Śakra and Brahmā when they approach such bodhisattvas.

source: ལོངས་སྤྱོད་ཀྱི་སྟོབས་བསྐྱེད་པ་ནི་གང་ལག་ན་རིན་པོ་ཆེ་དང་ལོངས་སྤྱོད་མི་ཟད་པའོ། །
en: The developed power of wealth means having an inexhaustible wealth of jewels and riches at one’s disposal.

source: ལུས་ཀྱི་སྟོབས་བསྐྱེད་པ་ནི་གང་ཕ་རོལ་གྱི་གནོད་པ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བའོ། །
en: The developed power of the body means being impervious to harm from any opponent.

source: སེམས་ཀྱི་སྟོབས་བསྐྱེད་པ་ནི་གང་སེམས་གཅིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་རབ་ཏུ་ཤེས་པའོ། །
en: The developed power of the mind means knowing the mental activity of all beings.

source: རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པ་ནི་གང་རྫུ་འཕྲུལ་གྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་རྫུ་འཕྲུལ་དང་ཆོ་འཕྲུལ་ཐམས་ཅད་ཀྱིས་ཆོས་སྟོན་པའོ། །ཆོས་སྟོན་པའི་སྟོབས་བསྐྱེད་པ་ནི་འདི་ལྟ་སྟེ།
en: The developed power of magical transformation means teaching the Dharma to beings who are to be tamed by means of miraculous powers by displaying all kinds of magical transformations and miraculous displays.

source: ཅི་རིགས་པར་ཆོས་བསྟན་པས་གང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་བསྟན་པ་ཤེས་པ་དེ་དག་ཡང་དག་པར་སྡུག་བསྔལ་ཟད་པར་བྱ་བའི་ཕྱིར་ངེས་པར་འབྱུང་བའོ། །
en: The developed power of teaching the Dharma means giving different kinds of teachings so as to bring an end to suffering for those who understand the Dharma teachings of the bodhisattvas, thereby allowing them to reach emancipation.

source: བདུད་ཚར་གཅོད་པའི་སྟོབས་བསྐྱེད་པ་ནི་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ལ་བྱ་བ་མི་འདོར་བས་སྟོབས་མཉམ་པ་མེད་པ་ཡིན་ནོ། །
en: The developed power of subjugating Māra is an unequaled power because it does not reject any action undertaken for the sake of the qualities of the Buddha.

source: ནན་ཏན་གྱི་སྟོབས་བསྐྱེད་པ་ནི་འདི་ལྟ་སྟེ། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་སྟེ།
en: The developed power of perseverance means following through on one’s words.

source: དེ་དག་ནི་སྟོབས་བསྐྱེད་པ་རབ་ཏུ་འཐོབ་པ་བཅུ་དྲུག་གོ། །
en: Those are the sixteen developed powers that are attained.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གང་སྟོབས་བསྐྱེད་པ་བཅུ་དྲུག་པོ་དེ་དག་ཐོབ་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེས་རྟག་ཏུ་བག་ཡོད་པར་བྱའོ། །ཀླུའི་བདག་པོ་འདི་ལྟ་སྟེ།
en: “Lord of nāgas, bodhisattvas who wish to attain those sixteen developed powers must remain constantly heedful.

source: དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོར་ཆུ་ཐམས་ཅད་འབབ་པའོ། །ཀླུའི་བདག་པོ་དེ་བཞིན་དུ་བག་ཡོད་པར་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུའོ། །ཀླུའི་བདག་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་ས་ལ་ས་བོན་ཐམས་ཅད་སྐྱེའོ། །ཀླུའི་བདག་པོ་དེ་བཞིན་དུ་བག་ཡོད་པ་ལ་དགེ་བའི་ཆོས་ཐམས་ཅད་སྐྱེའོ། །
en: By analogy, lord of nāgas, just as all rivers flow into the great ocean, so do all buddha qualities gather in heedfulness; just as all seeds sprout in the earth, so do all virtuous qualities grow from heedfulness.

source: ཀླུའི་བདག་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་སེམས་ཅན་ཐམས་ཅད་དགའོ། །ཀླུའི་བདག་པོ་དེ་བཞིན་དུ་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལྷར་བཅས་པའི་འཇིག་རྟེན་དགའོ། །
en: By analogy, just as a universal monarch is adored by all beings, lord of nāgas, a heedful bodhisattva is adored by the whole world with its gods.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་གང་དག་ཅིག །སངས་རྒྱས་བྱང་ཆུབ་རྗེས་སུ་ཐོབ་འདོད་པ། །དེས་ནི་བག་མེད་སྤྱོད་པ་རྣམ་སྤངས་ནས། །རྟག་ཏུ་བག་ཡོད་པ་ལ་བརྩོན་འགྲུས་བྱ། །
en: At that moment, the Blessed One spoke these verses: “A wise bodhisattva Who wishes to attain the awakening of a buddha Must abandon heedless conduct And strive constantly for heedfulness.

source: མཁས་པ་བསྟེན་པའི་ཆོས་ལ་མོས་པ་དག །མཐར་ལྟ་བ་ལ་གནས་པར་མི་བྱེད་དེ། །རྒྱུ་མེད་རྐྱེན་མེད་ཆོས་ནི་ཡོད་མ་ཡིན། །ཆོས་ནི་རྒྱུར་བཅས་རྐྱེན་བཅས་རབ་ཏུ་ཤེས། །
en: “The wise, those with conviction concerning dependent phenomena, Do not rest in extreme views; They know there are no phenomena without causes and conditions, That phenomena arise with causes and conditions.

source: རྐྱེན་ལས་སྐྱེས་པ་གང་ཡིན་དེ་མ་སྐྱེས། །དེ་ལ་སྐྱེ་བ་ངོ་བོ་ཉིད་ཀྱིས་མེད། །
en: “That which arises from conditions is unborn— It has no intrinsic essence of arising.

source: རྐྱེན་ལ་རག་ལས་གང་ཡིན་སྟོང་པར་གསུངས། །
en: That which depends on conditions is taught to be empty.

source: སྟོང་ཉིད་གང་ཤེས་དེ་ནི་བག་ཡོད་པའོ། །
en: One who understands emptiness is heedful.

source: རྐྱེན་ཁར་གང་ལས་དེ་ནི་མཚན་མ་མེད། །སྨོན་ལམ་ལྡན་པ་ཞི་ཞིང་ཉེ་བར་ཞི། །
en: “That which derives from any condition is beyond signs, Beyond wishes, and peaceful.

source: མི་གཡོ་བེམས་པོ་རྩྭ་དང་ཤིང་ལྟ་བུ། །དེ་ལ་བདུད་ཀྱི་ཡུལ་ནི་ཡོད་མ་ཡིན། །
en: Inanimate matter like grass and trees Are not under the influence of māras.

source: རྐྱེན་གྱི་ཁར་ལས་འདི་ནི་གང་ཤེས་པ། །དེ་འདིར་ང་དང་ང་ཡིར་འབྱུང་མི་འབྱུང་། །
en: “For those who know this dependence upon conditions, The notions ‘I’ and ‘mine’ do not arise.

source: དེ་ནི་བདག་མིན་བདག་གི་མ་ཡིན་པར། །དེ་ལྟར་གང་ཤེས་དེ་ནི་བག་ཡོད་པའོ། །རྗེ་ཡོད་མ་ཡིན་ཡོངས་སུ་འཛིན་མེད་པ། །
en: Those who know there is no self and no ownership Are the heedful.

source: གཟུང་བ་མེད་ཅིང་གྲོལ་བར་བྱ་བ་མེད། །བཅིངས་མེད་གྲོལ་མེད་རང་བཞིན་འོད་གསལ་བར། །ཆོས་རྣམས་རྟག་ཏུ་ཤེས་པ་བག་ཡོད་པའོ། །
en: “Without mastery, without acquisitiveness, Without grasping or needing liberation, neither bound nor free, Those who always know phenomena as naturally luminous Are the heedful.

source: དོན་ལ་རྟོན་གྱི་ཚིག་འབྲུར་དགའ་མ་ཡིན། །རྟག་ཏུ་ཡེ་ཤེས་སྤྱོད་ཡུལ་རྣམ་ཤེས་གྲོལ། །ངེས་པའི་དོན་གྱི་མདོ་སྡེའི་ཚུལ་ཤེས་པ། །དེ་ནི་ཆོས་ལ་རྟོན་གྱི་གང་ཟག་མིན། །
en: “Relying on the meaning without cherishing the words, And firmly settled in the domain of wisdom, free from the realm of consciousness, Their understanding accords with the discourses of definitive meaning, And they rely on the Dharma, not on the individual.

source: སངས་རྒྱས་བསྟན་འདིར་དོན་ནི་སྟོང་ཉིད་དོན། །དེ་བཞིན་མཚན་མ་མེད་དང་སྨོན་ལས་གྲོལ། །སྲིད་པ་གསུམ་དང་རྟོག་དང་ལྟར་མི་གནས། །
en: “The main point of this teaching of the Buddha is emptiness, And likewise signlessness and wishlessness And not being stuck on the three realms, concepts, and views.

source: མདོ་དོན་གང་ཡིན་དེ་ནི་བག་ཡོད་པའོ། །
en: The meaning of the discourse is heedfulness.

source: སྒྲ་དང་བརྗོད་པས་བརྗོད་དུ་མེད་པས་ན། །ཆོས་དང་ཆོས་མིན་གཉིས་སུ་གང་མི་བྱེད། །ཆོས་རྣམས་འཇོག་བྱེད་པ་ཡང་ཡོད་མིན་ཏེ། །
en: “Because phenomena cannot be expressed by words or sounds, They cannot be divided into phenomena and non-phenomena— They are beyond establishment.

source: གང་ཟག་མེད་པའི་དོན་འདི་བག་ཡོད་པའོ། །
en: The meaning of the absence of individuality is heedfulness.

source: ཆོས་དོན་གཉེར་གྱི་ཉོན་མོངས་དོན་གཉེར་མིན། །
en: “Seeking the Dharma is not seeking the afflictions.

source: མིག་གཟུགས་མི་གཉེར་རྣ་དང་སྒྲ་ལ་མིན། །
en: It is not seeking the eye and forms, nor the ear and sounds.

source: སྣ་དྲི་མི་གཉེར་ལྕེ་དང་རོ་ལ་མིན། །
en: It is not seeking the nose and smells, nor the tongue and tastes.

source: ལུས་རེག་མ་ཡིན་ཡིད་དང་ཆོས་ལ་མིན། །
en: It is not seeking the body and tactile forms, nor consciousness and its objects.

source: གཟུགས་ཀྱི་སྐྱེ་དང་གནས་པ་དོན་མི་གཉེར། །ཚོར་མིན་འདུ་ཤེས་མ་ཡིན་འདུ་བྱེད་མིན། །རྣམ་པར་ཤེས་པའི་གནས་པའང་དོན་མི་གཉེར། །
en: “It is not seeking the arising or abiding of form, Nor is it seeking feeling, perception, Formation, or the states of consciousness.

source: དེ་འདྲ་དེ་ནི་ཆོས་དོན་གཉེར་ཞེས་བྱ། །
en: That which is called seeking the Dharma is like that.

source: ཁམས་གསུམ་པ་ཡི་གནས་པའང་དོན་མི་གཉེར། །བདག་དང་སེམས་ཅན་མི་གཉེར་ལྟ་རྨོངས་མིན། །
en: “It is not seeking the abodes of the three realms, Not seeking oneself or beings or deluded views.

source: གཟུགས་ལུས་ནམ་ཡང་དོན་དུ་གཉེར་མ་ཡིན། །མིག་བློ་མ་ཡིན་ཡིད་ཀྱང་དོན་མི་གཉེར། །
en: It is never pursuing the physical body, Nor any of the sense consciousnesses.

source: དགེ་འདུན་མི་གཉེར་ཆོས་ཀྱང་དོན་མི་གཉེར། །
en: “It is not seeking the Saṅgha or even seeking the Dharma.

source: སྦྱིན་པ་ནམ་དུའང་དོན་དུ་མི་གཉེར་ཞིང་། །ཚུལ་ཁྲིམས་བཟོད་མིན་བརྩོན་འགྲུས་བསམ་གཏན་མིན། །
en: It is not seeking generosity Or discipline, diligence, or concentration.

source: བདག་གི་བྱེ་བྲག་ཤེས་རབ་དོན་མི་གཉེར། །
en: It is especially not seeking insight.

source: ཆོས་ཀུན་དོན་དུ་མི་གཉེར་གང་ཡིན་པ། །དེ་ནི་རྟག་ཏུ་ཆོས་གཉེར་རྒྱལ་བས་གསུངས། །
en: “The Victor said that those who seek no phenomena Are those who always seek the Dharma.

source: ནམས་ཀྱང་དོན་རྣམས་མི་གཉེར་གང་ཡིན་པ། །དེ་ནི་སངས་རྒྱས་བསྟན་འདིར་བག་ཡོད་ཡིན། །
en: In this teaching of the Buddha, Those who never seek anything are the heedful.

source: སྐྱེ་བ་མེད་ཤེས་སངས་རྒྱས་ཡེ་ཤེས་ཏེ། །
en: “Knowing the unborn is the wisdom of a buddha.

source: སྐྱེ་མེད་གང་ཡིན་དེ་ནི་འབྱུང་བ་མིན། །འབྱུང་བ་མེད་ལ་ཞི་བའང་ཡོད་མ་ཡིན། །
en: That which is unborn has no origin, And that which has no origin is at peace and does not exist.

source: དེ་ལྟར་གང་ཤེས་དེ་ནི་ལམ་སྒོམ་ཡིན། །
en: Those who understand in that way cultivate the path.

source: ཕུང་པོ་ལྔ་ནི་སྒྱུ་མ་ལྟ་བུར་ཤེས། །ཇི་ལྟར་ཆོས་དབྱིངས་དེ་ལྟར་ཆོས་རྣམས་ཤེས། །ནང་གི་གྲོང་སྟོང་འདྲ་བར་རབ་ཏུ་ཤེས། །
en: “They know the five aggregates to be like illusions, They know phenomena to be the same as the realm of phenomena, And they know the senses are like an empty village.

source: དེ་ལྟར་གང་ཤེས་དེ་ནི་བག་ཡོད་པའོ། །
en: Those who understand in that way are the heedful.

source: ཆོས་ཀྱི་དབྱེར་མེད་པ་དང་དབྱེ་བ་དང་། །དེ་བཞིན་སེམས་ཅན་དབང་པོ་རྣམས་ཀྱང་ཤེས། །དྲན་པ་ཉེ་བར་གཞག་ལ་དྲན་མི་འཇུག །
en: “They know both the indivisibility and the distinctness of phenomena, They know the faculties of beings, And they know that the applications of mindfulness are beyond mindfulness.

source: དེ་འདྲའི་ཡེ་ཤེས་སྟོབས་ཅན་བག་ཡོད་པའོ། །
en: Those endowed with this power of wisdom are the heedful.

source: ཡང་དག་སྤོང་ལ་གཉིས་སུ་རབ་ཤེས་དང་། །དེ་ནི་རྫུ་འཕྲུལ་སེམས་སྟོབས་རབ་ཏུ་ཤེས། །སྟོབས་ལ་ཐུལ་བ་ཡོད་པ་མ་ཡིན་དང་། །དབང་པོ་རྣམས་ཀྱི་རིམ་པ་ཤེས་པ་དང་། །
en: “They know both aspects of correct exertions, They know the mind’s power of magical transformation And that the powers cannot be subdued, And they know the stages of the strengths.

source: བྱང་ཆུབ་ཡན་ལག་བསམ་གཏན་ཁོང་དུ་ཆུད། །མཁས་པ་འདུས་མ་བྱས་པའི་ཆོས་མངོན་ཤེས། །
en: “Those wise ones have mastered the branches of awakening and the concentrations.

source: ཞི་གནས་ལ་ནི་སེམས་རབ་ཞི་བར་ཤེས། །ལྷག་མཐོང་གིས་ནི་ཆོས་རྣམས་དབྱེ་བ་རྟོགས། །
en: They realize the uncompounded nature of phenomena, They know how to settle their minds through the practice of tranquility, And they know how to discern phenomena through the practice of special insight.
